#include<iostream>
#include<cmath>
#include<stdlib.h>

using namespace std;


int main(){
    //问题：编号1-n的n个球依次吐出，有一个容量为k的袋子，设计一种方法，使得吐出i个球(i>=k)时，编号1-i的球在袋中的概率均为k/i
    //解决方法：蓄水池算法：对于1-k的球直接放入袋中即可，对于后面的球，每个球以k/i的概率放入袋中，若放入袋中则在袋中的k个球随机选择一个丢弃
    
    //证明：对于编号i(1<=i<=k), 在放第k个球时，其在袋中的概率为1；放k+1球时，其不在袋中的情况是，k+1球被选中，放入袋中，并i球被丢弃
    //概率为k/(k+1)*1/k = 1/k+1, 则从放k球到k+1球过程中i球在袋中的概率为k/(k+1)
    //放k+2球时，i球被丢弃的概率为k/(k+2)*1/k = 1/k+2, 则从放k球到k+1球过程中i球在袋中的概率为(k+1)/(k+2)
    //依次类推：放n球时，丢弃概率为k/n*1/k = 1/n, 则从放n-1球到n球过程中i球在袋中的概率为(n-1)/(n)
    //最终i球仍在袋中的概率为1*k/(k+1)*(k+1)/(k+2)*..*(n-1)/n = k/n

    //对于编号i(k<i<=n),选第i个球时，i在袋中的概率为k/i，选第i+1球时，i不在袋中的概率为k/(i+1)*1/k = 1/(i+1),则i在袋中的概率为i/(i+1)
    //依次类推最终i球仍在袋中的概率为k/i*i/(i+1)*..*(n-1)/n = k/n
    int n,k;
    cin>>n>>k;
    int arr[k];
    int i;
    int r;
    int rk;
    for(i=1;i<=k;++i){
        arr[i-1] = i;
    }
    for(;i<=n;++i){
        r = rand()%i;
        if(r<k){
            rk = rand()%k;
            arr[rk] = i;
        }
    }

    return 0;
}
